Tekla Open API Reference for Tekla Structures 2025
ReinforcementBase.ReinforcementBaseAttributes.VisibleLines Property
 The line type of the visible lines of the reinforcement.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public LineTypeAttributes VisibleLines { get; set; }
Public Property VisibleLines As LineTypeAttributes
	Get
	Set
Property Value
Type: LineTypeAttributes
See Also
Reference
ReinforcementBase.ReinforcementBaseAttributes Class
Tekla.Structures.Drawing Namespace